src/DataProcessors/ИС_ЯМ_ВыгрузкаКарточекТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ИС_ЯМ_ВыгрузкаКарточекТоваров</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ИС_ЯМ_СоответствиеЗначенийХарактеристик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_ЯМ_СоответствиеЗначенийХарактеристик</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидРеквизита1С</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_Ozon_ВидРеквизитаСопоставления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Реквизит1С</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФиксированноеЗначение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_ЗначенияЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_КатегорииТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаЯМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_Характеристика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеХарактеристикиЯМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_ЗначенияХарактеристик</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеХарактеристики</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ИС_Ozon_ВидРеквизитаСопоставления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_Ozon_ВидРеквизитаСопоставления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДопРеквизитНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопРеквизитХарактеристикиНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопСвойствоНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеквизитНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированноеЗначение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеквизитХарактеристикиНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШтрихкодНоменклатуры</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ИС_ЯМ_КатегорииТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ИС_ЯМ_КатегорииТоваров</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>parent_id</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>properties</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИС_ЯМ_Характеристика</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>required</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ИС_ЯМ_Характеристика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ИС_ЯМ_Характеристика</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>type</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеХарактеристики</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>filtering</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>distinctive</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>multivalue</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>allowCustomValues</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MD5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>defaultUnitId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>limitingParameterId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>unit</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЕдИзм</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИС_ЯМ_ЗначенияЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>valueRestrictions</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>limitingOptionValueId</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>id</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/ИС_ЯМ_ВыгрузкаКарточекТоваров/Forms/ФормаСопоставленияПолейНоменклатуры/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаКлиенте
Процедура СоответствиеХарактеристикРеквизит1СОчистка(Элемент, СтандартнаяОбработка)

	//+ ИнфоСофт Стояк Ю.К. 02.04.2025 УА #97736	
	//ТекущаяСтрока = Элементы.СоответствиеХарактеристик.ТекущиеДанные;
	ТекущаяСтрока = Элементы.СоответствиеЗначений.ТекущиеДанные;
	//- ИнфоСофт Стояк Ю.К. 02.04.2025 УА #97736

	УдалитьСопоставлениеХарактеристики(Категория, ТекущаяСтрока.ХарактеристикаЯМ);

	ТекущаяСтрока.Реквизит1С 	 		= Неопределено;
	ТекущаяСтрока.ВидРеквизита1С 		= ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ПустаяСсылка");
	ТекущаяСтрока.ФиксированноеЗначение = Неопределено;

	ТекущаяСтрока.СопоставленоЗначений = ТекстКоличествоСопоставленныхЗначений(
		Категория, ТекущаяСтрока.ХарактеристикаЯМ, ТекущаяСтрока.ВидРеквизита1С, ТекущаяСтрока.Реквизит1С,
		ТекущаяСтрока.ТребуетсяСопоставление);

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

&НаКлиенте
Процедура КатегорияПриИзменении(Элемент)
	ЗаполнитьСоответствиеКатегории();
КонецПроцедуры 

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаКлиенте
Процедура ВидРеквизитаСопоставленияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитНоменклатуры"));
	СписокВыбора.Добавить(ПредопределенноеЗначение(
	"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитНоменклатуры"));
	СписокВыбора.Добавить(ПредопределенноеЗначение(
	"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопСвойствоНоменклатуры"));
	Если ЕстьВидНоменклатурыУХарактеристики() Тогда
		СписокВыбора.Добавить(ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ХарактеристикаНоменклатуры"));
	КонецЕсли;
	СписокВыбора.Добавить(ПредопределенноеЗначение(
	"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитХарактеристикиНоменклатуры"));
	СписокВыбора.Добавить(ПредопределенноеЗначение(
	"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитХарактеристикиНоменклатуры"));
	
	СписокВыбора.Добавить(ПредопределенноеЗначение(
	"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ФиксированноеЗначение"));
	СписокВыбора.Добавить(ПредопределенноеЗначение(
	"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ШтрихкодНоменклатуры"));
	
	ДанныеВыбора = СписокВыбора;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаКлиенте
Процедура ВидРеквизитаСопоставленияОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;

	ТекущаяСтрока = Элементы.СоответствиеЗначений.ТекущиеДанные;

	Если ВыбранноеЗначение = ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитНоменклатуры") Тогда

		МассивЗначений = РеквизитыНоменклатуры();

	ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитНоменклатуры") Тогда

		МассивЗначений = ДопРеквизитыНабора();

	ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопСвойствоНоменклатуры") Тогда

		МассивЗначений = ДопСвойстваНоменклатуры();

	ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитХарактеристикиНоменклатуры") Тогда

		МассивЗначений = РеквизитыХарактеристикиНоменклатуры();

	ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитХарактеристикиНоменклатуры") Тогда

		МассивЗначений = НаборыДопРеквизитовХарактеристикиНоменклатуры();

	ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ХарактеристикаНоменклатуры") Тогда

		МассивЗначений = ВидыНоменклатурыХарактеристик();

	ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ФиксированноеЗначение") Тогда
		
		ТекущаяСтрока.ВидРеквизита1С = ВыбранноеЗначение;
		Возврат;

	ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ШтрихкодНоменклатуры") Тогда
		
		ТекущаяСтрока.ВидРеквизита1С = ВыбранноеЗначение;
		ДобавитьСопоставлениеХарактеристики(
				Категория, ТекущаяСтрока.ХарактеристикаЯМ, ТекущаяСтрока.ВидРеквизита1С, ТекущаяСтрока.Реквизит1С,
			ТекущаяСтрока.ФиксированноеЗначение, ТекущаяСтрока.ЕдиницаИзмерения);
		Возврат;

	КонецЕсли;

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("МассивЗначений", МассивЗначений);

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВидРеквизита1С", ВыбранноеЗначение);

	Оповещение = Новый ОписаниеОповещения("ВыборРеквизитаДляЗаполнения", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Обработка.ИС_ЯМ_ВыгрузкаКарточекТоваров.Форма.ФормаВыбора", СтруктураПараметров, , , , , Оповещение,
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаКлиенте
Процедура СоответствиеЗначенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле = Элементы.СоответствиеЗначенийСопоставленоЗначений Тогда

		СтандартнаяОбработка = Ложь;

		ТекущаяСтрока = СоответствиеЗначений.НайтиПоИдентификатору(ВыбраннаяСтрока);

		Если Не ЗначениеЗаполнено(ТекущаяСтрока.Реквизит1С) Или Не ТекущаяСтрока.ТребуетсяСопоставление Тогда
			Возврат;
		КонецЕсли;

		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Категория", Категория);
		ПараметрыФормы.Вставить("ХарактеристикаЯМ", ТекущаяСтрока.ХарактеристикаЯМ);
		ПараметрыФормы.Вставить("ВидРеквизита1С", ТекущаяСтрока.ВидРеквизита1С);
		ПараметрыФормы.Вставить("Реквизит1С", ТекущаяСтрока.Реквизит1С);
		ПараметрыФормы.Вставить("НаборЗначений", ТекущаяСтрока.НаборЗначений);
		ПараметрыФормы.Вставить("ЕдИзм", ТекущаяСтрока.ЕдиницаИзмерения);
		Оповещение = Новый ОписаниеОповещения("ПриЗакрытииФормыСопоставленияЗначений", ЭтотОбъект,
			Новый Структура("ВыбраннаяСтрока", ВыбраннаяСтрока));

		ОткрытьФорму("Обработка.ИС_ЯМ_ВыгрузкаКарточекТоваров.Форма.ФормаСопоставленияЗначений", ПараметрыФормы, ЭтотОбъект, , , ,
			Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаКлиенте
Процедура СоответствиеХарактеристикФиксированноеЗначениеПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.СоответствиеХарактеристик.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущаяСтрока.ФиксированноеЗначение) Тогда
		ДобавитьСопоставлениеХарактеристики(
				Категория, ТекущаяСтрока.ХарактеристикаЯМ, ТекущаяСтрока.ВидРеквизита1С, ТекущаяСтрока.Реквизит1С,
			ТекущаяСтрока.ФиксированноеЗначение, ТекущаяСтрока.ЕдиницаИзмерения);
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаКлиенте
Процедура СоответствиеХарактеристикФиксированноеЗначениеОчистка(Элемент, СтандартнаяОбработка)

	//+ ИнфоСофт Стояк Ю.К. 02.04.2025 УА #97736	
	//ТекущаяСтрока = Элементы.СоответствиеХарактеристик.ТекущиеДанные;
	ТекущаяСтрока = Элементы.СоответствиеЗначений.ТекущиеДанные;
	//- ИнфоСофт Стояк Ю.К. 02.04.2025 УА #97736

	УдалитьСопоставлениеХарактеристики(
		Категория, ТекущаяСтрока.ХарактеристикаЯМ);
	ТекущаяСтрока.Реквизит1С 	 = Неопределено;
	ТекущаяСтрока.ВидРеквизита1С = ПредопределенноеЗначение("Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ПустаяСсылка");

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 28.05.2024 УА #65724
&НаКлиенте
Процедура СоответствиеЗначенийЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.СоответствиеЗначений.ТекущиеДанные;
	
	МассивЗначений = СоответствиеЗначенийЕдиницаИзмеренияНачалоВыбораНаСервере(ТекущаяСтрока.ХарактеристикаЯМ);
	
	Если МассивЗначений.Количество() > 0 Тогда 
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("МассивЗначений", МассивЗначений);
				
		Оповещение = Новый ОписаниеОповещения("ВыборЕдИзм", ЭтотОбъект);
		
		ОткрытьФорму("Обработка.ИС_ЯМ_ВыгрузкаКарточекТоваров.Форма.ФормаВыбора", СтруктураПараметров, , , , , Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
		
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Для данной характристики нет единиц измерения");
	КонецЕсли;
	
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 28.05.2024 УА #65724

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаСервере
Процедура ЗаполнитьСоответствиеКатегории()
	//ПоляКатегорий.Параметры.УстановитьЗначениеПараметра("Ссылка", Категория);
	
	СоответствиеЗначений.Очистить();
	Если Не ЗначениеЗаполнено(Категория) Тогда
		Возврат;
	КонецЕсли;

	СоответствиеРеквизитовНоменклатуры =  ИС_MP_ВыгрузкаКарточек.СоответствиеРеквизитовНоменклатуры();
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИС_ЯМ_КатегорииТоваровХарактеристики.Характеристика КАК ХарактеристикаЯМ,
	|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.Реквизит1С КАК Реквизит1С,
	|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
	|	ВЫБОР
	|		КОГДА ИС_ЯМ_Характеристика.type = ""ENUM""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТребуетсяСопоставление,
	|	ИС_ЯМ_КатегорииТоваровХарактеристики.required КАК Обязательная,
	|	ИС_ЯМ_Характеристика.multivalue КАК НаборЗначений,
	|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.ФиксированноеЗначение КАК ФиксированноеЗначение,
	|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ИЗ
	|	Справочник.ИС_ЯМ_КатегорииТоваров.properties КАК ИС_ЯМ_КатегорииТоваровХарактеристики
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_ЯМ_СоответствиеЗначенийХарактеристик КАК ИС_ЯМ_СоответствиеЗначенийХарактеристик
	|		ПО ИС_ЯМ_КатегорииТоваровХарактеристики.Характеристика = ИС_ЯМ_СоответствиеЗначенийХарактеристик.ХарактеристикаЯМ
	|			И ИС_ЯМ_КатегорииТоваровХарактеристики.Ссылка = ИС_ЯМ_СоответствиеЗначенийХарактеристик.Категория
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_ЯМ_Характеристика КАК ИС_ЯМ_Характеристика
	|		ПО ИС_ЯМ_КатегорииТоваровХарактеристики.Характеристика = ИС_ЯМ_Характеристика.Ссылка
	|ГДЕ
	|	ИС_ЯМ_КатегорииТоваровХарактеристики.Ссылка = &Категория
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_ЯМ_КатегорииТоваровХарактеристики.Характеристика,
	|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.Реквизит1С,
	|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.ВидРеквизита1С,
	|	ВЫБОР
	|		КОГДА ИС_ЯМ_Характеристика.type = ""ENUM""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ИС_ЯМ_КатегорииТоваровХарактеристики.required,
	|	ИС_ЯМ_Характеристика.multivalue,
	|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.ФиксированноеЗначение,
	|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.ЕдиницаИзмерения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Обязательная УБЫВ";

	Запрос.УстановитьПараметр("Категория", Категория);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл

		НоваяСтрока = СоответствиеЗначений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка); 
		
		НоваяСтрока.СопоставленоЗначений = ИС_ЯМ_Сервер.ТекстКоличествоСопоставленныхЗначений(
				Категория, НоваяСтрока.ХарактеристикаЯМ, НоваяСтрока.ВидРеквизита1С, НоваяСтрока.Реквизит1С,
			НоваяСтрока.ТребуетсяСопоставление);

	КонецЦикла;  
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаСервере
Функция РеквизитыНоменклатуры()
	Возврат ИС_MP_ВыгрузкаКарточек.РеквизитыНоменклатуры();
КонецФункции //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаСервере
Функция ДопСвойстваНоменклатуры()
	Возврат ИС_MP_ВыгрузкаКарточек.ДопСвойстваНоменклатуры();
КонецФункции //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаСервере
Функция НаборыДопРеквизитовХарактеристикиНоменклатуры()
	Возврат ИС_MP_ВыгрузкаКарточек.НаборыДопРеквизитовХарактеристикиНоменклатуры();
КонецФункции //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаСервере
Функция ВидыНоменклатурыХарактеристик()
	Возврат ИС_MP_ВыгрузкаКарточек.ВидыНоменклатурыХарактеристик();
КонецФункции //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаСервере
Функция РеквизитыХарактеристикиНоменклатуры()
	Возврат ИС_MP_ВыгрузкаКарточек.РеквизитыХарактеристикиНоменклатуры();
КонецФункции //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаСервере
Функция ДопРеквизитыНабора(Результат = Неопределено)
	Возврат ИС_MP_ВыгрузкаКарточек.ДопРеквизитыНабора(Результат)
КонецФункции //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаСервереБезКонтекста
Функция ЕстьВидНоменклатурыУХарактеристики()

	Возврат ИС_MP_ВыгрузкаКарточек.ЕстьВидНоменклатурыУХарактеристики();

КонецФункции //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаСервере
Функция ТекстКоличествоСопоставленныхЗначений(Категория, ХарактеристикаЯМ, ВидРеквизита1С, Реквизит1С, ТребуетсяСопоставление)
	Возврат ИС_ЯМ_Сервер.ТекстКоличествоСопоставленныхЗначений(Категория, ХарактеристикаЯМ, ВидРеквизита1С, Реквизит1С, ТребуетсяСопоставление);
КонецФункции //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаКлиенте
Процедура ВыборРеквизитаДляЗаполнения(Результат, СтруктураПараметров) Экспорт

	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;

	ТекущаяСтрока = Элементы.СоответствиеЗначений.ТекущиеДанные;

	Если ТипЗнч(Результат) = Тип("СправочникСсылка.НаборыДополнительныхРеквизитовИСведений") Тогда

		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ВидРеквизита1С", СтруктураПараметров.ВидРеквизита1С);

		Оповещение = Новый ОписаниеОповещения("ВыборРеквизитаДляЗаполнения", ЭтотОбъект, ДополнительныеПараметры);

		МассивЗначений = ДопРеквизитыНабора(Результат);
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("МассивЗначений", МассивЗначений);

		ОткрытьФорму("Обработка.ИС_ЯМ_ВыгрузкаКарточекТоваров.Форма.ФормаВыбора", СтруктураПараметров, , , , , Оповещение,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	Иначе

		ТекущаяСтрока.ВидРеквизита1С = СтруктураПараметров.ВидРеквизита1С;
		ТекущаяСтрока.Реквизит1С 	 = Результат;

	КонецЕсли;

	Если ЗначениеЗаполнено(ТекущаяСтрока.Реквизит1С) Тогда
		ДобавитьСопоставлениеХарактеристики(
			Категория, ТекущаяСтрока.ХарактеристикаЯМ, ТекущаяСтрока.ВидРеквизита1С, ТекущаяСтрока.Реквизит1С,
			ТекущаяСтрока.ФиксированноеЗначение, ТекущаяСтрока.ЕдиницаИзмерения);

		ТекущаяСтрока.СопоставленоЗначений = ТекстКоличествоСопоставленныхЗначений(
			Категория, ТекущаяСтрока.ХарактеристикаЯМ, ТекущаяСтрока.ВидРеквизита1С, ТекущаяСтрока.Реквизит1С,
			ТекущаяСтрока.ТребуетсяСопоставление);
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574   

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаКлиенте
Процедура ПриЗакрытииФормыСопоставленияЗначений(ДанныеПоСопоставленнымЗначениям, ДополнительныеПараметры) Экспорт

	ТекущаяСтрока = СоответствиеЗначений.НайтиПоИдентификатору(ДополнительныеПараметры.ВыбраннаяСтрока);

	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТекущаяСтрока.СопоставленоЗначений = ТекстКоличествоСопоставленныхЗначений(
		Категория, ТекущаяСтрока.ХарактеристикаЯМ, ТекущаяСтрока.ВидРеквизита1С, ТекущаяСтрока.Реквизит1С,
		ТекущаяСтрока.ТребуетсяСопоставление);

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаСервере
Процедура УдалитьСопоставлениеХарактеристики(Категория, ХарактеристикаЯМ)	
	ИС_ЯМ_Сервер.УдалитьСопоставлениеХарактеристики(Категория, ХарактеристикаЯМ);
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаСервере
Процедура ДобавитьСопоставлениеХарактеристики(Категория, ХарактеристикаЯМ, ВидРеквизита1С, Реквизит1С, ФиксированноеЗначение, ЕдиницаИзмерения)	
	ИС_ЯМ_Сервер.ДобавитьСопоставлениеХарактеристики(Категория, ХарактеристикаЯМ, ВидРеквизита1С, Реквизит1С, ФиксированноеЗначение, ЕдиницаИзмерения); 
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 28.05.2024 УА #65724
&НаСервере
Функция СоответствиеЗначенийЕдиницаИзмеренияНачалоВыбораНаСервере(ХарактеристикаЯМ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_ЯМ_Характеристикаunit.ЕдИзм КАК ЕдИзм
		|ИЗ
		|	Справочник.ИС_ЯМ_Характеристика.unit КАК ИС_ЯМ_Характеристикаunit
		|ГДЕ
		|	ИС_ЯМ_Характеристикаunit.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ХарактеристикаЯМ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ЕдИзм");

КонецФункции //- ИнфоСофт Стояк Ю.К. 28.05.2024 УА #65724 

//+ ИнфоСофт Стояк Ю.К. 28.05.2024 УА #65724
&НаКлиенте
Процедура ВыборЕдИзм(Результат, СтруктураПараметров) Экспорт

	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;

	ТекущаяСтрока = Элементы.СоответствиеЗначений.ТекущиеДанные;
	ТекущаяСтрока.ЕдиницаИзмерения 	 = Результат; 
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.Реквизит1С) Тогда
		ДобавитьСопоставлениеХарактеристики(
			Категория, ТекущаяСтрока.ХарактеристикаЯМ, ТекущаяСтрока.ВидРеквизита1С, ТекущаяСтрока.Реквизит1С,
			ТекущаяСтрока.ФиксированноеЗначение, ТекущаяСтрока.ЕдиницаИзмерения);

		ТекущаяСтрока.СопоставленоЗначений = ТекстКоличествоСопоставленныхЗначений(
			Категория, ТекущаяСтрока.ХарактеристикаЯМ, ТекущаяСтрока.ВидРеквизита1С, ТекущаяСтрока.Реквизит1С,
			ТекущаяСтрока.ТребуетсяСопоставление);
	КонецЕсли;
	
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 28.05.2024 УА #65724

#КонецОбласти
